{
	//Gift Taste Dialogue
	//-------------------
	//Love
	"Gift.Love.Diala": "Oh, this is wonderful! Thank you, @!",
	"Gift.Love.Deniz": "For me? Thank you, I love it!",
	//Like
	"Gift.Like.Diala": "Aw, this is a nice gift. Thank you!",
	"Gift.Like.Deniz": "I appreciate it, thank you, @!",
	//Dislike
	"Gift.Dislike.Diala": "Uh...thanks, I guess?",
	"Gift.Dislike.Deniz": "What's this? I'm...not sure I like it very much.",
	//Hate
	"Gift.Hate.Diala": "@? I don't think you should be going around giving this to people.",
	"Gift.Hate.Deniz": "I don't think even the cats at the cafe would like this, @.",
	//Neutral
	"Gift.Neutral.Diala": "Hopefully Deniz won't notice if I put this in his room.",
	"Gift.Neutral.Deniz": "Uh, thanks.", 

	//Event Dialogue
	//--------------

	//Movie Reactions
	//---------------

	//Map Strings
	//-----------

	//Festival Dialogue
	//-----------------

	//Egg Festival
	"Festivals.EggFest.Diala": "Deniz and I helped Emily with painting the eggs!$h#$b#Look for the splotchy ones if you're participating, those are Deniz's.$h",
	"Festivals.EggFest.Diala_spouse": "Hi, love! Would you like a good luck kiss for the egg hunt?$h#$b#No, I'm not using the egg hunt as an excuse.$4",
	"Festivals.EggFest.Deniz": "Diala wanted to put her bunny ears on me for the festival. Little does she know, I hid them last night.$h",
    "Festivals.EggFest.Deniz_spouse": "Honey, what do all the eggs want to do when the egg hunt starts?$h#$b#Scramble!$h",

    //Flower Dance
    "Festivals.FlowerDance.Diala": "I'm conflicted between wanting to dance and staying out of it so I can take some embarrassing pictures of Deniz dancing.$h",
    "Festivals.FlowerDance.Diala_spouse": "You look wonderful, my love. Let me take a picture of you before the dance starts.$4",
    "Festivals.FlowerDance.Deniz": "Don't get me wrong, I love these festivals, I just wish I could stay home with the cats instead.$h",
    "Festivals.FlowerDance.Deniz_spouse": "Hey, honey. Why don't you give me a kiss?$4#$b#Or should I say...let's put our tulips together.$u#$b#Okay, okay, I'll stop.$h",

    //Luau
    "Festivals.Luau.Diala": "I put some herbs from my garden into the soup.#$b#...Some seasoning too when Marnie wasn't looking. No one wants to eat bland soup.$h",
    "Festivals.Luau.Diala_spouse": "Hey, love. Wanna go for a swim before they start? The water's really nice this time of year.$h",
    "Festivals.Luau.Deniz": "I forgot to get something for the soup so I'm taking credit for whatever Diala puts in.$u#$b#If it's something bad, I had absolutely nothing to do with it.$h",
    "Festivals.Luau.Deniz_spouse": "Hey, honey. You make the best soup...you must be a soup-erstar.$u",

    //Moonlight Jellies
    "Festivals.Jellies.Diala": "You should see how wide Deniz's eyes get when the jellyfish show up, it's adorable!$h",
    "Festivals.Jellies.Diala_spouse": "I love watching the jellyfish with you. I get to have two breathtaking views around me.$h",
    "Festivals.Jellies.Deniz": "I'm almost sure I saw Diala doze off twice. Not because she's bored, but she's not one to stay up this late usually.$h",
    "Festivals.Jellies.Deniz_spouse": "No puns today, I just wanna enjoy the view with the love of my life.$h",

    //Stardew Fair
    "Festivals.StardewFair.Diala": "I kicked Deniz's ass at the slingshot game! I'm gonna hold this over him forever.$h",
    "Festivals.StardewFair.Diala_spouse": "Hey, wanna try some of the games with me? Loser makes dinner!$h",
    "Festivals.StardewFair.Deniz": "I'm not gonna lie, I'm mostly here for Gus' food. It's delicious!$h",
    "Festivals.StardewFair.Deniz_spouse": "Honey, look at me. We're gonna win this thing and then you're gonna get me that fedora from the prize stall.$h",

    //Spirit's Eve
    "Festivals.SpiritEve.Diala": "Deniz and I are both easily scared, but it's all a matter of who jump-scares the other first.$h",
    "Festivals.SpiritEve.Diala_spouse": "Tell me all about the maze later, my love.$h#$b#I'll just...stay here, away from the creepy moving hands.$s",
    "Festivals.SpiritEve.Deniz": "I know Diala is planning to jump-scare me, I'm keeping an eye out for any funny business.$h",
    "Festivals.SpiritEve.Deniz_spouse": "Arrr, wanna search me for treasure?$u",

    //Ice Festival
    "Festivals.IceFest.Diala": "It sure is cold out here, huh?#$b#I was planning on staying in but Deniz wants to build a snowman.$h",
    "Festivals.IceFest.Diala_spouse": "Hey, love. Come closer, let me warm you up before the competition.$4",
    "Festivals.IceFest.Deniz": "Hey, @! Wanna help me and Diala build a snowman?$h#$b#Ooh, maybe we can make snow angels too!$h",
    "Festivals.IceFest.Deniz_spouse": "Hey, honey. You're gonna do great at the fishing competition, you're fin-tastic!$u",

    //WinterStar

   "Festivals.WinterStar.Diala": "Happy Winter Star, @! I got my secret friend a batch of chocolate chip cookies!$h#$b#I also made some cat-safe cookies for the cats.$h",
   "Festivals.WinterStar.Diala_spouse": "I get to spend this holiday with the love of my life, what more could I ask for?$4",
   "Festivals.WinterStar.Deniz": "Happy holidays, @! I hope you've had a wonderful year.$h#$b#I got to cuddle the cats this morning, so I'm in a great mood.$h",
   "Festivals.WinterStar.Deniz_spouse": "I must be a snowflake, because I've fallen for you.$u#$b#Happy Winter Star, honey.$h",

    //Romance Dialogue
    //----------------

    //Diala
   "Romance.Engagement.Diala0": "You've made me the happiest person alive, @.$4",
   "Romance.Engagement.Diala1": "I'm so lucky to have met you, love.$4.",
   "Romance.FemaleWeddingFix.MaleFarmer1.Diala": "When @ first arrived in Pelican Town, no one knew if he'd fit in with our community...#$b#But from this day forward, @ is going to be as much a part of this town as any of us!$h#$b#It is my great honor on this day {0} of {1}, to unite @ and Diala in the bonds of marriage.",
   "Romance.FemaleWeddingFix.MaleFarmer2.Diala": "@... Diala... #$b# As the mayor of Pelican Town, and regional bearer of the matrimonial seal, I now pronounce you husband and wife!$h", 
   "Romance.FemaleWeddingFix.FemaleFarmer1.Diala": "When @ first arrived in Pelican Town, no one knew if she'd fit in with our community...#$b#But from this day forward, @ is going to be as much a part of this town as any of us!$h#$b#It is my great honor on this day {0} of {1}, to unite @ and Diala in the bonds of marriage.",
   "Romance.FemaleWeddingFix.FemaleFarmer2.Diala": "@... Diala... #$b# As the mayor of Pelican Town, and regional bearer of the matrimonial seal, I now pronounce you wife and..., well, wife!$h",
   "Romance.give.flowersA.Diala": "Wait...for me?$4#$b#Yes, of course, @! Nothing would make me happier.$4",
   "Romance.give.flowersB.Diala": "Wait...for me?$4#$b#Yes, of course, @! Nothing would make me happier.$4",
   "Romance.stardrop.gift.Diala": "Hey, love. You do so much for us and I wanted to do something for you in return.$4#$b#I love you, @. Thank you for being such a wonderful, supportive partner.",
   "Romance.rejectNPCA.Diala": "Oh...$u#$b#I'm sorry, @. You're a great friend, I just don't see this going anywhere right now.$s",
   "Romance.rejectNPCB.Diala": "Oh...$u#$b#I'm sorry, @. You're a great friend, I just don't see this going anywhere right now.$s",
   "Romance.MovieInvite.Spouse.Diala": "Ooh, date night!$h#$b#I'll see you there, my love.",

    //Deniz
   "Romance.Engagement.Deniz0": "I'm in love with you, @.$4",
   "Romance.Engagement.Deniz1": "I can't believe I'm marrying the hottest person alive.$u",
   "Romance.give.flowersA.Deniz": "Pretty flowers you got there.#$b#What do you mean they're for me?$h#$b#...OH! Of course, I would love to be you boyfriend, @.$4",
   "Romance.give.flowersB.Deniz": "Pretty flowers you got there.#$b#What do you mean they're for me?$h#$b#...OH! Of course, I would love to be you boyfriend, @.$4",
   "Romance.stardrop.gift.Deniz": "I never expected to feel this way about someone. I can't seem to put my feelings into words right now, so I hope this gift conveys them instead.$4#$b#Thank you for loving me and laughing at all my bad puns.$h",
   "Romance.rejectNPCA.Deniz": "Sorry, @. I'm not into you like that, I hope you understand.$s",
   "Romance.rejectNPCB.Deniz": "Sorry, @. I'm not into you like that, I hope you understand.$s",
   "Romance.MovieInvite.Spouse.Deniz": "Movie night? Great!$h#$b#I'll take care of the snacks, honey.$u",


	//Dialogue
	//--------

    //Diala
    "Diala.Dialogue.Introduction": "Hi! I'm Diala. You must be the new farmer who just moved in!$h#$b#It's nice to meet you! I co-own D&D's Cat Cafe in town, you should come by soon.$h",
    //Spring
    "Diala.Dialogue.spring_1": "The beginning of spring always feels more exciting than other seasons for some reason.$h",
    "Diala.Dialogue.spring_12": "Hey, @! Are you participating in the egg hunt tomorrow?$h",
    "Diala.Dialogue.spring_23": "I'm still trying to pick a cute outfit for the dance tomorrow, maybe I'll get Deniz to help me out.",
    //Summer
    "Diala.Dialogue.summer_1": 


}